mdbsliguo/stm32_template_SPL/Examples/MAX31856/MAX3185601_ReadTemperature/main_example.c
/**
 * @file main_example.c
 * @brief 案例 - MAX31856热电偶温度传感器读取示例
 * @details 演示MAX31856的初始化、配置和温度读取功能
 * 
 * 硬件连接：
 * - MAX31856模块连接到SPI2
 *   - CS：PB12
 *   - SCK：PB13（SPI2_SCK）
 *   - SDO：PB14（SPI2_MISO）
 *   - SDI：PB15（SPI2_MOSI）
 *   - VCC：3.3V
 *   - GND：GND
 * 
 * 功能演示：
 * 1. MAX31856初始化（硬件SPI接口）
 * 2. 配置热电偶类型（K型）
 * 3. 配置采样模式（16次平均）
 * 4. 配置转换模式（连续转换）
 * 5. 读取热电偶温度
 * 6. 读取冷端温度
 * 7. 故障检测和处理
 */

#include "stm32f10x.h"
#include "system_init.h"
#include "led.h"
#include "delay.h"
#include "oled_ssd1306.h"
#include "spi_hw.h"
#include "max31856.h"
#include "config.h"
#include "error_handler.h"
#include "log.h"
#include <stdint.h>
#include <stdio.h>
#include <string.h>

/**
 * @brief 在OLED上显示热电偶温度信息
 */
static void DisplayThermocoupleTemperature(float temperature)
{
    char buffer[17];
    uint8_t i;
    
    /* 温度显示（格式：TC: 123.45C） */
    if (temperature < 0)
    {
        snprintf(buffer, sizeof(buffer), "TC:-%.2fC", -temperature);
    }
    else
    {
        snprintf(buffer, sizeof(buffer), "TC: %.2fC", temperature);
    }
    OLED_ShowString(2, 1, buffer);
    /* 清除行尾残留字符 */
    for (i = strlen(buffer) + 1; i <= 16; i++)
    {
        OLED_ShowChar(2, i, ' ');
    }
}

/**
 * @brief 在OLED上显示冷端温度信息
 */
static void DisplayColdJunctionTemperature(float temperature)
{
    char buffer[17];
    uint8_t i;
    
    /* 温度显示（格式：CJ: 25.00C） */
    if (temperature < 0)
    {
        snprintf(buffer, sizeof(buffer), "CJ:-%.2fC", -temperature);
    }
    else
    {
        snprintf(buffer, sizeof(buffer), "CJ: %.2fC", temperature);
    }
    OLED_ShowString(3, 1, buffer);
    /* 清除行尾残留字符 */
    for (i = strlen(buffer) + 1; i <= 16; i++)
    {
        OLED_ShowChar(3, i, ' ');
    }
}

/**
 * @brief 在OLED上显示故障信息
 */
static void DisplayFaultStatus(uint8_t fault_flags)
{
    char buffer[17];
    uint8_t i;
    
    if (fault_flags == 0)
    {
        snprintf(buffer, sizeof(buffer), "Fault: OK");
    }
    else
    {
        snprintf(buffer, sizeof(buffer), "Fault: 0x%02X", fault_flags);
    }
    OLED_ShowString(4, 1, buffer);
    /* 清除行尾残留字符 */
    for (i = strlen(buffer) + 1; i <= 16; i++)
    {
        OLED_ShowChar(4, i, ' ');
    }
}

/**
 * @brief MAX31856初始化流程（极简版本）
 * @return MAX31856_Status_t 初始化状态，MAX31856_OK表示成功，其他值表示失败
 */
static MAX31856_Status_t MAX31856_InitRoutine(void)
{
    MAX31856_Status_t status;
    MAX31856_Config_t config;
    
    OLED_Clear();
    OLED_ShowString(1, 1, "MAX31856 Init");
    Delay_ms(500);
    
    /* 1. 配置MAX31856（硬件SPI接口） */
    config.interface_type = MAX31856_INTERFACE_HARDWARE;
    config.config.hardware.spi_instance = SPI_INSTANCE_2;
    config.config.hardware.cs_port = GPIOB;
    config.config.hardware.cs_pin = GPIO_Pin_12;
    
    status = MAX31856_Init(&config);
    if (status != MAX31856_OK)
    {
        OLED_ShowString(2, 1, "Init Fail!");
        OLED_ShowString(3, 1, "Error:");
        char err_buf[17];
        snprintf(err_buf, sizeof(err_buf), "%d", status);
        OLED_ShowString(4, 1, err_buf);
        Delay_ms(3000);
        return status;
    }
    OLED_ShowString(2, 1, "Init OK");
    Delay_ms(500);
    
    /* 2. 设置K型热电偶 */
    status = MAX31856_SetThermocoupleType(MAX31856_TC_TYPE_K);
    if (status != MAX31856_OK)
    {
        OLED_ShowString(3, 1, "Set Type Fail!");
        Delay_ms(2000);
        return status;
    }
    OLED_ShowString(3, 1, "Type: K");
    Delay_ms(300);
    
    /* 3. 设置4次平均 */
    status = MAX31856_SetAvgMode(MAX31856_AVG_SEL_4);
    if (status != MAX31856_OK)
    {
        OLED_ShowString(3, 1, "Set Avg Fail!");
        Delay_ms(2000);
        return status;
    }
    
    /* 4. 先设置单次转换模式，触发第一次转换 */
    status = MAX31856_SetConvMode(MAX31856_CONV_MODE_ONE_SHOT);
    if (status != MAX31856_OK)
    {
        OLED_ShowString(3, 1, "Set Mode Fail!");
        Delay_ms(2000);
        return status;
    }
    
    /* 5. 触发第一次转换 */
    status = MAX31856_TriggerOneShot();
    if (status != MAX31856_OK)
    {
        OLED_ShowString(3, 1, "Trigger Fail!");
        Delay_ms(2000);
        return status;
    }
    
    /* 6. 等待第一次转换完成（4次平均约250ms，等待800ms） */
    OLED_ShowString(4, 1, "Wait Conv...");
    Delay_ms(800);
    
    /* 7. 切换到连续转换模式 */
    status = MAX31856_SetConvMode(MAX31856_CONV_MODE_CONTINUOUS);
    if (status != MAX31856_OK)
    {
        OLED_ShowString(3, 1, "Set Mode Fail!");
        Delay_ms(2000);
        return status;
    }
    
    /* 8. 清除故障 */
    MAX31856_ClearFault();
    Delay_ms(100);
    
    /* 9. 等待稳定 */
    OLED_ShowString(4, 1, "Wait 2s...");
    Delay_ms(2000);
    
    OLED_ShowString(4, 1, "Ready!");
    Delay_ms(500);
    
    return MAX31856_OK;
}

/**
 * @brief 主函数
 */
int main(void)
{
    SPI_Status_t spi_status;
    MAX31856_Status_t max31856_status;
    OLED_Status_t oled_status;
    float tc_temperature = 0.0f;
    float cj_temperature = 0.0f;
    uint8_t fault_flags = 0;
    uint32_t last_read_tick = 0;
    
    /* 系统初始化 */
    System_Init();
    
    /* LED初始化 */
    if (LED_Init() != LED_OK)
    {
        while (1) { /* 初始化失败，死循环 */ }
    }
    
    /* OLED初始化（默认显示器） */
    oled_status = OLED_Init();
    if (oled_status != OLED_OK)
    {
        /* OLED初始化失败，LED快速闪烁 */
        while (1) 
        { 
            LED_Toggle(LED_1); 
            Delay_ms(200); 
        }
    }
    
    OLED_Clear();
    OLED_ShowString(1, 1, "Example");
    OLED_ShowString(2, 1, "MAX31856 Demo");
    OLED_ShowString(3, 1, "SPI2 PB12-15");
    Delay_ms(1500);
    
    /* 初始化SPI2 */
    OLED_Clear();
    OLED_ShowString(1, 1, "Init SPI2...");
    Delay_ms(300);
    spi_status = SPI_HW_Init(SPI_INSTANCE_2);
    if (spi_status != SPI_OK)
    {
        OLED_ShowString(2, 1, "SPI2 Init Fail!");
        char err_buf[17];
        snprintf(err_buf, sizeof(err_buf), "Error: %d", spi_status);
        OLED_ShowString(3, 1, err_buf);
        Delay_ms(3000);
        while (1) 
        { 
            LED_Toggle(LED_1); 
            Delay_ms(200); 
        }
    }
    OLED_ShowString(2, 1, "SPI2 OK");
    Delay_ms(500);
    
    /* 执行MAX31856初始化流程 */
    max31856_status = MAX31856_InitRoutine();
    if (max31856_status != MAX31856_OK)
    {
        /* MAX31856初始化失败，显示错误信息并进入错误处理循环 */
        OLED_Clear();
        OLED_ShowString(1, 1, "MAX31856 Init");
        OLED_ShowString(2, 1, "FAILED!");
        char err_buf[17];
        snprintf(err_buf, sizeof(err_buf), "Error: %d", max31856_status);
        OLED_ShowString(3, 1, err_buf);
        OLED_ShowString(4, 1, "Check Hardware");
        Delay_ms(3000);
        
        /* 进入错误处理循环：LED闪烁，OLED显示错误信息 */
        while (1) 
        { 
            LED_Toggle(LED_1); 
            Delay_ms(200); 
        }
    }
    
    /* 主循环：读取并显示温度 */
    OLED_Clear();
    OLED_ShowString(1, 1, "MAX31856 Reading");
    uint32_t current_tick = 0;
    
    while (1)
    {
        current_tick = Delay_GetTick();
        
        /* 每500ms读取一次温度 */
        if (Delay_GetElapsed(current_tick, last_read_tick) >= 500)
        {
            last_read_tick = current_tick;
            
            /* 读取故障状态 */
            max31856_status = MAX31856_ReadFault(&fault_flags);
            if (max31856_status == MAX31856_OK)
            {
                DisplayFaultStatus(fault_flags);
                
                /* 如果有故障，清除故障标志 */
                /* 注意：某些故障（如CJ_LOW）可能是芯片未完全初始化导致的，
                 * 清除后需要等待一段时间让芯片稳定
                 */
                if (fault_flags != 0)
                {
                    MAX31856_ClearFault();
                    /* 如果检测到CJ_LOW故障，说明冷端温度传感器未就绪，需要等待 */
                    if (fault_flags & 0x40)  /* CJ_LOW */
                    {
                        Delay_ms(100);  /* 等待冷端温度传感器稳定 */
                    }
                }
            }
            else if (max31856_status == MAX31856_ERROR_SPI_FAILED)
            {
                /* SPI通信错误，显示错误信息 */
                OLED_ShowString(4, 1, "Fault: SPI ERR");
            }
            else
            {
                /* 其他错误 */
                char err_buf[17];
                snprintf(err_buf, sizeof(err_buf), "Fault Err: %d", max31856_status);
                OLED_ShowString(4, 1, err_buf);
            }
            
            /* 读取热电偶温度 */
            max31856_status = MAX31856_ReadThermocoupleTemperature(&tc_temperature);
            if (max31856_status == MAX31856_OK)
            {
                DisplayThermocoupleTemperature(tc_temperature);
            }
            else
            {
                /* 根据错误码显示更友好的错误信息 */
                if (max31856_status == MAX31856_ERROR_FAULT)
                {
                    /* 检查具体故障类型 */
                    uint8_t fault_check;
                    if (MAX31856_CheckFault(MAX31856_FAULT_OPEN, &fault_check) == MAX31856_OK && fault_check)
                    {
                        OLED_ShowString(2, 1, "TC: OPEN FAULT");
                    }
                    else
                    {
                        OLED_ShowString(2, 1, "TC: FAULT");
                    }
                }
                else if (max31856_status == MAX31856_ERROR_SPI_FAILED)
                {
                    OLED_ShowString(2, 1, "TC: SPI ERR");
                }
                else
                {
                    char err_buf[17];
                    snprintf(err_buf, sizeof(err_buf), "TC Err: %d", max31856_status);
                    OLED_ShowString(2, 1, err_buf);
                }
            }
            
            /* 读取冷端温度 */
            max31856_status = MAX31856_ReadColdJunctionTemperature(&cj_temperature);
            if (max31856_status == MAX31856_OK)
            {
                DisplayColdJunctionTemperature(cj_temperature);
            }
            else
            {
                /* 根据错误码显示更友好的错误信息 */
                if (max31856_status == MAX31856_ERROR_SPI_FAILED)
                {
                    OLED_ShowString(3, 1, "CJ: SPI ERR");
                }
                else if (max31856_status == MAX31856_ERROR_FAULT)
                {
                    OLED_ShowString(3, 1, "CJ: FAULT");
                }
                else
                {
                    char err_buf[17];
                    snprintf(err_buf, sizeof(err_buf), "CJ Err: %d", max31856_status);
                    OLED_ShowString(3, 1, err_buf);
                }
            }
            
            /* LED闪烁指示系统运行 */
            LED_Toggle(LED_1);
        }
        
        /* Delay hook */
        Delay_ms(10);
    }
}

